perf/test_results/gunicorn/limitTest.txt
./run-scenario.sh limitTest gunicorn

> perf@1.0.0 artillery /home/fabrizio/Escritorio/Arq soft/2c20-tp-1/perf
> artillery "run" "limitTest.yaml" "-e" "gunicorn"

Started phase 0 (PlainZero1), duration: 10s @ 12:59:37(-0300) 2020-11-11
Report @ 12:59:47(-0300) 2020-11-11
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 120s @ 12:59:47(-0300) 2020-11-11
Report @ 12:59:57(-0300) 2020-11-11
Elapsed time: 20 seconds
  Scenarios launched:  995
  Scenarios completed: 995
  Requests completed:  995
  Mean response/sec: 100.2
  Response time (msec):
    min: 0.8
    max: 42.5
    median: 1
    p95: 1.5
    p99: 24.2
  Codes:
    200: 995

Warning: 
CPU usage of Artillery seems to be very high (pids: 22640)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:00:07(-0300) 2020-11-11
Elapsed time: 30 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 31.1
    median: 1
    p95: 1.5
    p99: 2
  Codes:
    200: 1000

Report @ 13:00:17(-0300) 2020-11-11
Elapsed time: 40 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 2.2
    median: 1
    p95: 1.5
    p99: 1.8
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 22640).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:00:27(-0300) 2020-11-11
Elapsed time: 50 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 3.5
    median: 1
    p95: 1.5
    p99: 1.7
  Codes:
    200: 1000

Report @ 13:00:37(-0300) 2020-11-11
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 3.1
    median: 1
    p95: 1.4
    p99: 1.7
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 22640).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:00:47(-0300) 2020-11-11
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 2.1
    median: 1
    p95: 1.3
    p99: 1.6
  Codes:
    200: 1000

Report @ 13:00:57(-0300) 2020-11-11
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 3.7
    median: 1
    p95: 1.4
    p99: 1.6
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 22640).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:01:07(-0300) 2020-11-11
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 5.7
    median: 0.9
    p95: 1.3
    p99: 1.5
  Codes:
    200: 1000

Report @ 13:01:17(-0300) 2020-11-11
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 6.2
    median: 0.9
    p95: 1.4
    p99: 1.6
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 22640).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:01:27(-0300) 2020-11-11
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 3.5
    median: 0.9
    p95: 1.3
    p99: 1.5
  Codes:
    200: 1000

Report @ 13:01:37(-0300) 2020-11-11
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 9.9
    median: 0.9
    p95: 1.3
    p99: 1.5
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 22640).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:01:47(-0300) 2020-11-11
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 3.3
    median: 0.9
    p95: 1.3
    p99: 1.6
  Codes:
    200: 1000

Started phase 2 (PlainZero2), duration: 10s @ 13:01:47(-0300) 2020-11-11
Report @ 13:01:57(-0300) 2020-11-11
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  14
  Scenarios completed: 14
  Requests completed:  14
  Mean response/sec: 1.4
  Response time (msec):
    min: 1
    max: 4.5
    median: 1.3
    p95: 4.5
    p99: 4.5
  Codes:
    200: 14

Report @ 13:01:57(-0300) 2020-11-11
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 2
  Response time (msec):
    min: 3.2
    max: 3.2
    median: 3.2
    p95: 3.2
    p99: 3.2
  Codes:
    200: 1

All virtual users finished
Summary report @ 13:01:57(-0300) 2020-11-11
  Scenarios launched:  12010
  Scenarios completed: 12010
  Requests completed:  12010
  Mean response/sec: 92.01
  Response time (msec):
    min: 0.8
    max: 42.5
    median: 1
    p95: 1.4
    p99: 1.8
  Scenario counts:
    Root (/): 12010 (100%)
  Codes:
    200: 12010

fabrizio@fabrizio-desktop:~/Escritorio/Arq soft/2c20-tp-1/perf$ ./run-scenario.sh limitTest gunicorn

> perf@1.0.0 artillery /home/fabrizio/Escritorio/Arq soft/2c20-tp-1/perf
> artillery "run" "limitTest.yaml" "-e" "gunicorn"

Started phase 0 (PlainZero1), duration: 10s @ 13:02:15(-0300) 2020-11-11
Report @ 13:02:25(-0300) 2020-11-11
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 120s @ 13:02:25(-0300) 2020-11-11
Report @ 13:02:35(-0300) 2020-11-11
Elapsed time: 20 seconds
  Scenarios launched:  998
  Scenarios completed: 998
  Requests completed:  998
  Mean response/sec: 100.2
  Response time (msec):
    min: 0.9
    max: 26.4
    median: 1
    p95: 1.4
    p99: 6.8
  Codes:
    200: 998

Warning: 
CPU usage of Artillery seems to be very high (pids: 23595)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:02:45(-0300) 2020-11-11
Elapsed time: 30 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 24.8
    median: 1
    p95: 1.5
    p99: 2.1
  Codes:
    200: 1000

Report @ 13:02:55(-0300) 2020-11-11
Elapsed time: 40 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 89.2
    median: 1
    p95: 1.6
    p99: 5
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 23595).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:03:05(-0300) 2020-11-11
Elapsed time: 50 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 2.7
    median: 1
    p95: 1.4
    p99: 2
  Codes:
    200: 1000

Report @ 13:03:15(-0300) 2020-11-11
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 3.6
    median: 1
    p95: 1.5
    p99: 2.1
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 23595).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:03:25(-0300) 2020-11-11
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 4
    median: 1
    p95: 1.4
    p99: 2
  Codes:
    200: 1000

Report @ 13:03:35(-0300) 2020-11-11
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 2.1
    median: 1
    p95: 1.4
    p99: 1.9
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 23595).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:03:45(-0300) 2020-11-11
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 2.8
    median: 1
    p95: 1.3
    p99: 1.9
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 23595).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:03:55(-0300) 2020-11-11
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 3.3
    median: 1
    p95: 1.4
    p99: 1.9
  Codes:
    200: 1000

Report @ 13:04:05(-0300) 2020-11-11
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100.1
  Response time (msec):
    min: 0.8
    max: 2.6
    median: 1
    p95: 1.3
    p99: 1.9
  Codes:
    200: 1000

Warning: High CPU usage warning (pids: 23595).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:04:15(-0300) 2020-11-11
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 2.8
    median: 1
    p95: 1.3
    p99: 1.8
  Codes:
    200: 1000

Report @ 13:04:25(-0300) 2020-11-11
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  1000
  Scenarios completed: 1000
  Requests completed:  1000
  Mean response/sec: 100
  Response time (msec):
    min: 0.8
    max: 3.5
    median: 1
    p95: 1.3
    p99: 1.9
  Codes:
    200: 1000

Started phase 2 (PlainZero2), duration: 10s @ 13:04:25(-0300) 2020-11-11
Warning: High CPU usage warning (pids: 23595).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:04:35(-0300) 2020-11-11
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  11
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: 1.1
  Response time (msec):
    min: 1.1
    max: 4.3
    median: 1.3
    p95: 4.3
    p99: 4.3
  Codes:
    200: 11

Report @ 13:04:36(-0300) 2020-11-11
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 1.96
  Response time (msec):
    min: 1.1
    max: 1.1
    median: 1.1
    p95: 1.1
    p99: 1.1
  Codes:
    200: 1

All virtual users finished
Summary report @ 13:04:36(-0300) 2020-11-11
  Scenarios launched:  12010
  Scenarios completed: 12010
  Requests completed:  12010
  Mean response/sec: 92.02
  Response time (msec):
    min: 0.8
    max: 89.2
    median: 1
    p95: 1.4
    p99: 2
  Scenario counts:
    Root (/): 12010 (100%)
  Codes:
    200: 12010



------------------------------------


./run-scenario.sh limitTest gunicorn

> perf@1.0.0 artillery /home/fabrizio/Escritorio/Arq soft/2c20-tp-1/perf
> artillery "run" "limitTest.yaml" "-e" "gunicorn"

Started phase 0 (PlainZero1), duration: 10s @ 13:07:36(-0300) 2020-11-11
Report @ 13:07:46(-0300) 2020-11-11
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 120s @ 13:07:46(-0300) 2020-11-11
Report @ 13:07:56(-0300) 2020-11-11
Elapsed time: 20 seconds
  Scenarios launched:  4993
  Scenarios completed: 4992
  Requests completed:  4992
  Mean response/sec: 499.7
  Response time (msec):
    min: 0.7
    max: 29.1
    median: 1
    p95: 4.4
    p99: 16.6
  Codes:
    200: 4992

Warning: 
CPU usage of Artillery seems to be very high (pids: 26022)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:08:06(-0300) 2020-11-11
Elapsed time: 30 seconds
  Scenarios launched:  5000
  Scenarios completed: 5000
  Requests completed:  5000
  Mean response/sec: 501
  Response time (msec):
    min: 0.7
    max: 11.8
    median: 0.9
    p95: 2.2
    p99: 4.9
  Codes:
    200: 5000

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:08:16(-0300) 2020-11-11
Elapsed time: 40 seconds
  Scenarios launched:  5000
  Scenarios completed: 4916
  Requests completed:  4916
  Mean response/sec: 501
  Response time (msec):
    min: 0.7
    max: 166.3
    median: 0.9
    p95: 55.8
    p99: 147.4
  Codes:
    200: 4916

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:08:26(-0300) 2020-11-11
Elapsed time: 50 seconds
  Scenarios launched:  5000
  Scenarios completed: 4279
  Requests completed:  4279
  Mean response/sec: 501
  Response time (msec):
    min: 167.2
    max: 3072.2
    median: 864.2
    p95: 1225.3
    p99: 2189.9
  Codes:
    200: 4279

Report @ 13:08:36(-0300) 2020-11-11
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  5000
  Scenarios completed: 4171
  Requests completed:  4171
  Mean response/sec: 500.5
  Response time (msec):
    min: 1196.8
    max: 11629.5
    median: 1239.5
    p95: 2637.3
    p99: 5274.9
  Codes:
    200: 4171
  Errors:
    ECONNRESET: 1

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:08:46(-0300) 2020-11-11
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  5000
  Scenarios completed: 4089
  Requests completed:  4089
  Mean response/sec: 500.5
  Response time (msec):
    min: 1209.8
    max: 17793.4
    median: 1250.9
    p95: 3284.2
    p99: 8743.8
  Codes:
    200: 4089
  Errors:
    ECONNRESET: 5

Report @ 13:08:56(-0300) 2020-11-11
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  5000
  Scenarios completed: 6808
  Requests completed:  6808
  Mean response/sec: 500
  Response time (msec):
    min: 0.7
    max: 31772.8
    median: 336.3
    p95: 15476.9
    p99: 30505
  Codes:
    200: 6808
  Errors:
    ECONNRESET: 22

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:09:06(-0300) 2020-11-11
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  5000
  Scenarios completed: 5709
  Requests completed:  5709
  Mean response/sec: 501
  Response time (msec):
    min: 0.7
    max: 33949.5
    median: 1
    p95: 31542.3
    p99: 31647.8
  Codes:
    200: 5709

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:09:16(-0300) 2020-11-11
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  5000
  Scenarios completed: 5000
  Requests completed:  5000
  Mean response/sec: 500.5
  Response time (msec):
    min: 0.7
    max: 17.9
    median: 0.9
    p95: 2.3
    p99: 7.7
  Codes:
    200: 5000

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:09:26(-0300) 2020-11-11
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  5000
  Scenarios completed: 3897
  Requests completed:  3897
  Mean response/sec: 501
  Response time (msec):
    min: 0.7
    max: 4811.9
    median: 1075.3
    p95: 1359.3
    p99: 2455.1
  Codes:
    200: 3897

Report @ 13:09:36(-0300) 2020-11-11
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  5000
  Scenarios completed: 3662
  Requests completed:  3662
  Mean response/sec: 500
  Response time (msec):
    min: 1355.7
    max: 11904.1
    median: 1408.4
    p95: 4066.9
    p99: 6168.8
  Codes:
    200: 3662
  Errors:
    ECONNRESET: 1

Warning: High CPU usage warning (pids: 26022).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 13:09:46(-0300) 2020-11-11
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  5000
  Scenarios completed: 3401
  Requests completed:  3401
  Mean response/sec: 500.5
  Response time (msec):
    min: 1438.9
    max: 20064.4
    median: 1509.1
    p95: 4713.1
    p99: 10219.5
  Codes:
    200: 3401
  Errors:
    ECONNRESET: 18

Started phase 2 (PlainZero2), duration: 10s @ 13:09:46(-0300) 2020-11-11
Report @ 13:09:56(-0300) 2020-11-11
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  16
  Scenarios completed: 3010
  Requests completed:  3010
  Mean response/sec: 1.7
  Response time (msec):
    min: 1
    max: 31668.5
    median: 8425.3
    p95: 31491.9
    p99: 31617.2
  Codes:
    200: 3010
  Errors:
    ECONNRESET: 185

Report @ 13:10:05(-0300) 2020-11-11
Elapsed time: 2 minutes, 28 seconds
  Scenarios launched:  1
  Scenarios completed: 814
  Requests completed:  814
  Mean response/sec: 0.12
  Response time (msec):
    min: 2.2
    max: 33910.7
    median: 31498.1
    p95: 31632.8
    p99: 31662.4
  Codes:
    200: 814
  Errors:
    ECONNRESET: 30

All virtual users finished
Summary report @ 13:10:05(-0300) 2020-11-11
  Scenarios launched:  60010
  Scenarios completed: 59748
  Requests completed:  59748
  Mean response/sec: 432.54
  Response time (msec):
    min: 0.7
    max: 33949.5
    median: 357.8
    p95: 15388.1
    p99: 31561.8
  Scenario counts:
    Root (/): 60010 (100%)
  Codes:
    200: 59748
  Errors:
    ECONNRESET: 262